Pandas 15 - Memecah Nilai String dari Suatu Kolom ke Dalam Beberapa Kolom Baru
Source : Indonesia Belajar

Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

Persiapan Data Frame

In [2]:
# Membuat data frame menggunakan dictionary sebagai sumber datanya
# Data frame memiliki dua kolom, 'nama' dan 'tempat_kelahiran', yang berisi informasi tentang nama dan tempat kelahiran seseorang
data = {'nama':['Rafi Ahmad', 'Chris John', 'Ade Rai'], 
        'tempat_kelahiran':['Bandung, Jawa Barat', 'Banjarnegara, Jawa Tengah', 'Jakarta, DKI Jakarta']}

df = pd.DataFrame(data)

# Menampilkan data frame yang telah dibuat
df

         nama           tempat_kelahiran
0  Rafi Ahmad        Bandung, Jawa Barat
1  Chris John  Banjarnegara, Jawa Tengah
2     Ade Rai       Jakarta, DKI Jakarta

Memecah Nama Depan dan Nama Belakang

In [3]:
# Menggunakan metode str.split untuk membagi kolom 'nama' menjadi dua kolom, 'nama_depan' dan 'nama_belakang'
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)

# Menampilkan data frame dengan tambahan dua kolom baru, 'nama_depan' dan 'nama_belakang'
df

         nama           tempat_kelahiran nama_depan nama_belakang
0  Rafi Ahmad        Bandung, Jawa Barat       Rafi         Ahmad
1  Chris John  Banjarnegara, Jawa Tengah      Chris          John
2     Ade Rai       Jakarta, DKI Jakarta        Ade           Rai

Memecah Nama Kota dan Propinsi

In [4]:
# Menggunakan metode str.split untuk membagi kolom 'tempat_kelahiran' menjadi dua kolom, 'kota' dan 'propinsi'
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)

# Menampilkan data frame dengan tambahan dua kolom baru, 'kota' dan 'propinsi'
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Rafi Ahmad,"Bandung, Jawa Barat",Rafi,Ahmad,Bandung,Jawa Barat
1,Chris John,"Banjarnegara, Jawa Tengah",Chris,John,Banjarnegara,Jawa Tengah
2,Ade Rai,"Jakarta, DKI Jakarta",Ade,Rai,Jakarta,DKI Jakarta